# SCH-MDETR Full K=3 for Det-Fly visible-light UAV detection.

nc: 1
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, sch_mamba_adapters, [5, 3, RN50, openai, true, 3, true, true, true, true, true, true, 1, ['UAV'], 'a visible-light image containing a {name}']]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [[1, 16, 19, 22], 1, SCH_GUIDE_RTDETRDecoder, [nc, 192, 300, 4, 8, 3]]
