# Pure lightweight RT-DETR-N: ResNet-18 style backbone with a reduced decoder.

nc: 80
scales:
  n: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']]  # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]  # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]  # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]  # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]   # 4-P2/4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]  # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]  # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]  # 7-P5/32

head:
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, AIFI, [512, 4]]  # 9
  - [-1, 1, Conv, [128, 1, 1]]  # 10, Y5

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11
  - [6, 1, Conv, [128, 1, 1, None, 1, 1, False]]  # 12 input_proj.1
  - [[-2, -1], 1, Concat, [1]]  # 13
  - [-1, 2, RepC3, [128]]  # 14, fpn_blocks.0
  - [-1, 1, Conv, [128, 1, 1]]  # 15, Y4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 16
  - [5, 1, Conv, [128, 1, 1, None, 1, 1, False]]  # 17 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 18
  - [-1, 2, RepC3, [128]]  # 19, fpn_blocks.1

  - [-1, 1, Conv, [128, 3, 2]]  # 20
  - [[-1, 15], 1, Concat, [1]]  # 21
  - [-1, 2, RepC3, [128]]  # 22, pan_blocks.0

  - [-1, 1, Conv, [128, 3, 2]]  # 23
  - [[-1, 10], 1, Concat, [1]]  # 24
  - [-1, 2, RepC3, [128]]  # 25, pan_blocks.1

  # RTDETRDecoder(nc, hidden_dim, num_queries, decoder_points, heads, decoder_layers, ffn_dim)
  - [[19, 22, 25], 1, RTDETRDecoder, [nc, 128, 100, 4, 4, 3, 512]]
